{"type":"data","nodes":[null,{"type":"data","data":[{"programme_slug":1,"year_slug":2,"max_years":3,"name":4,"img":5,"courses":6},"geografi","1","3","Geogrāfu kursi","../../trails.jpg",[7,13,19,25,31],{"title":8,"img":9,"altText":10,"teaser":11,"content":12},"Cilvēku ģeogrāfjia","../../geo-cilveku-geog.jpg","Trepes uz kurām sēž vairākas cilvēku grupiņas.","Kurss par un ap cilvēkiem un kur tie dzīvo...","Šajā kursā ir iespējams uzzināt, ne tikai cilvēku demogrāfiskos rādītājus, bet arī cilvēku kultūras un reliģijas izcelsmes vietas, to attīstība un kopējā izplatība. Šajā kursā ir iespējams tuvāk izpētīt, katru pasaules daļu un uzzināt vairāk, par cilvēku kultūru, reliģiju, dzīves stilu, u.c.",{"title":14,"img":15,"altText":16,"teaser":17,"content":18},"Zemes zinātnes","../../geo-zemes-zinatnes.jpg","Roka, kas tur kvarca kristālu ar ķērpi tajā.","Kas planētai Zeme vēderā?","Kurss kas ir zināms visiem ar ģeogrāfiju saistītajiem. Šajā kursā ir iespējams uzzināt par to, kas atrodas planētas Zemes vēderā. Šajā kursā ir iespējams uzzināt, dažādu iežu viedošanos procesu, kā atpazīt iežus un daudz citus procesus, kas notiek uz šīs planētas, kā piemēram, vulkānu izvirdumi, tsunami, zemestrīces un citas dabas stihijas.",{"title":20,"img":21,"altText":22,"teaser":23,"content":24},"Klimatoloģija un meteroloģijas pamati","../../geo-meterologija.jpg","Zilas debesis ar lieliem baltiem mākoņiem pludmalē","Šeit dzimst laika ziņu diktori...","Kurss, kas dos ieskatu, kas notiek aiz TV3 laika ziņu durvīm un ko tieši Toms Bricis stāsta par tuvākajām laika prognozēm. Šajā kursā iemācās, kā darboties ar vairākām ierīcēm priekš tagadējo un nākotnes laikapstākļu prognozēšanai un cik ļoti svarīgi tas arī ir.",{"title":26,"img":27,"altText":28,"teaser":29,"content":30},"Augsnes zinātne","../../geo-augsnes-zinatne.jpg","Bedre, kurai gar sieniņu iet metramērs.","Kūdra, melnzeme, smiltis un ķīmija...","Viens no teorētiski garlaicīgākajiem kursiem, bet praktiski viens no visinteresantākajiem kursiem, kas ir piedāvāts šajā fakultātē. Kurss kas ir stipri balstīts uz ķīmijas pamatiem, bet kad to visu sastop dabā, tad tas dod lielāku ieskatu un sapratni, cik mūsu daba ir kompleksa un skaista.",{"title":32,"img":33,"altText":34,"teaser":35,"content":36},"Kartogrāfija","../../geo-kartografija.jpg","Veca, satalītuzņēmuma karte.","Šeit apmaldīties nav opcija...","Ģeogrāfijas studiju programmas viens no vissvarīgākajiem balstiem. Kā jau nosaukumā minēts, kurss ir balstīts ap kartēm, visu kas ir saistīts ar kartogrāfijas vēsturi un kā mūsdienās kartes tiek veidotas. Kursa laikā iemācīsies, ka pašam izveidot karti izmantojot vairāks datorprogrammas."],"uses":{"params":["name","year"]}}]}
