{"type":"data","nodes":[null,{"type":"data","data":[{"programme_slug":1,"year_slug":2,"max_years":3,"name":4,"img":5,"courses":6},"datoriki","1","4","Datoriķu kursi","../../trails.jpg",[7,13,18,23,28],{"title":8,"img":9,"altText":10,"teaser":11,"content":12},"Tīmekļa tehnoloģijas I","../../","Programmētājs lasa WW3 rakstu par HTML mācīšanos.","Šeit uzzina, ka HTML nav programmēšanas valoda...","Vienmēr ir jāsāk ar pašiem pamatiem, un tīmekļa tehnoloģijās tie ir HTML, CSS un JavaScript. Jā, klausīties par katras birkas nozīmēm un CSS stila iespējām izklausās garlaicīgi, un jāatzīst, pārsvarā tā arī ir. Pa vidu kursam parādīsies \"sidequest\" pamēģināt lietot Bootstrap, ko gan izmanto, jo industrija draudzējas ar Bootstrap, Tailwind un tāda veida CSS ietvariem. Līdz eksāmenam tev jau vajadzētu varēt izveidot tīri pieklājīgu statisku mājaslapu!",{"title":14,"img":9,"altText":15,"teaser":16,"content":17},"Algoritmi un programmēšana","Datora ekrāns, kurā ir atvērta CodeBlocks izstrādes vide.","Tava, visticamāk, pirmā sastapšanās ar C++...","Pat ja tu pirms universitātes esi pamēģinājis programmēt, visticamāk, ka ar mītisko briesmoni, ko sauc C++, tev vēl nebūs bijusi darīšana. Šī arī būs valoda, kurā pirmos divus universitātes gadus pārsvarā būs jāprogrammē, jādomā un jāmurgo. Bet kursa saturs tiek sākts tiešām no absolūtas nulles, tā ka nav jāuztraucas par iepriekšēju zināšanu trūkumu. Laboratorijas darbos būs iespēja izmēģināt jaunās prasmes un kļūdīties pirms kontroldarbiem.",{"title":19,"img":9,"altText":20,"teaser":21,"content":22},"Diskrētā matemātika datoriķiem","Pierakstu klades un papīra lapa uz kuras sarakstītas matemātiskās loģiskās izteiksmes.","Un tev likās ka vidusskolas matemātika ir grūta...","Diskrētā matemātika datoriķiem ir kā tikt iegrūstam ledainā ūdenī saulainā dienā. Ja tev šķita ka matemātika, ko apskatīs universitātē ir līdzīga vidusskolā mācītajam, šis kurss šo uzskatu sagraus. Katru mēnesi apskatīsiet jaunu, arvien sarežģītāku tēmu, kas gandrīz nekādi nav saistīta ar neko, kas iepriekš ir apskatīts. (Tāpēc to sauc par diskrēto matemātiku?) Paspēsiet iegūt pamatus matemātiskajā loģikā ar predikātiem un kvantoriem, apskatīt kopu teoriju, grafus un vēl daudz ko citu.",{"title":24,"img":9,"altText":25,"teaser":26,"content":27},"Operētājsistēmas","Datora startēšanas ekrāns ar zibatmiņu tam priekšā.","Windows, Linux un failu sistēmas...","Šajā kursā katram būs iespēja sajusties kā īstam hakerim, kādus redzam filmās. Apgūsi Windows un Linux failu sistēmu atšķirības, to, kā lietot virtuālās mašīnas un kā uzinstalēt jaunu operētājsistēmu uz savas ierīces. Brīdinājums - iespēja, ka uz tava datora paralēli klasiskajam Windows pēc šī kursa parādīsies kāds no Linux variantiem, ir liela. Ja būsi atjautīgs, iespējams, pēc šī kursa tev pelīti vairs nevajadzēs, jo kā profesionāls datoriķis visas darbības datorā veiksi caur termināli.",{"title":29,"img":9,"altText":30,"teaser":31,"content":32},"Datorsistēmu arhitektūra un datoru inženierijas pamati I","Datora kaste ar dažādām detaļām.","Kas datoram vēderā?","Datorsistēmu arhitektūras un datoru inženierijas pamatos tev vajadzētu iemācīties, kā strādā datori, mātesplates un loģikas vārti. Lai to izdarītu, ir vajadzīgi labi pasniedzēji. Viss, ko varu teikt, ir, ka ceru, ka tev paveiksies vairāk nekā man. Tomēr šī kursa saturu vismaz vispārējā līmenī vajadzētu zināt katram sevi cienošam datoriķim."],"uses":{"params":["name","year"]}}]}
