{"type":"data","nodes":[null,{"type":"data","data":[{"programme_slug":1,"year_slug":2,"max_years":3,"name":4,"img":5,"courses":6},"datoriki","2","4","Datoriķu kursi","../../trails.jpg",[7,13,18,23,28,33],{"title":8,"img":9,"altText":10,"teaser":11,"content":12},"Analītiskā ģeometrija","../../","Tāfele uz kuras ar krītu sazīmēti vektori un kalkulācijas.","Vienības vektors, paralēlvektors, visi vektori...","Analītiskā ģeometrija sākumā var izklausīties biedējoši, bet ar labu profesoru, labiem materiāliem un eksāmenu, kurā var lietot visus pierakstus, ātri vien sāksi saprast, cik viegli ir aprēķināt distanci starp punktiem vai nogriežņa vienības vektoru. Vēl jautrāk šis kurss kļūst brīdī, kad saproti, ka vieta, kur šīs tehnikas tiek izmantotas ļoti daudz, ir videospēles un citas simulācijas. Un kurš gan negrib iemācīties programmēt videospēles?",{"title":14,"img":9,"altText":15,"teaser":16,"content":17},"Praktiskā dziļā mašīnmācīšanās","Cilvēks, kas raksta jautājumu Chat-GPT programmai.","Arī tu varēsi lielīties ka zini kā strādā mākslīgais intalekts..","Pašlaik visai populāra tēma, ja vien nedzīvo zem akmens, ir mašīnmācīšanās (plašāk pazīstama kā AI vai ✨). Šajā kursā sapratīsi, kā tas strādā, bet neieslīgsi dziļos matemātiskos pamatojumos un vienādojumos. Lielāks uzsvars tiks likts tieši uz programmēšanu, un kursa beigās būsi izveidojis vairākus samērā vieglus, bet tomēr savus, mašīnmācīšanās modeļus, izmantojot Python.",{"title":19,"img":9,"altText":20,"teaser":21,"content":22},"Programminženierija","Mape ar dokumentiem","Šī kursa laikā tev gribēsies programmēt...","Kurss par to, kā veidot programmatūras projektējumu. Lekciju daļā galvenais ir neaizmigt un cerēt, ka testiņos pietiks ar loģisko domāšanu, lai izspriestu atbildi. Bet laboratorijas darbi ir tas, kur šis kurss parāda savus ilkņus – jums būs jāstrādā... komandās. Tātad, atrodiet savus piecus labākos draugus kursā un ceriet, ka neatklāsies, ka kāds no viņiem nespēj iesniegt darbu laikā vai komunicēt. Kursa beigās dokuments būs jāprezentē komisijai, it kā sagatavojot tevi kvalifikācijas darba aizstāvēšanai.",{"title":24,"img":9,"altText":25,"teaser":26,"content":27},"Varbūtību teorija un matemātiskā statistika","Cilvēks strādā ar eksel lietotājprogrammatūru.","Excel ir vislabākais kalkulātors...","Kurss sākās ar to, ka, kā es atceros, profesore teica: \"Un, protams, visiem aprēķiniem izmantosim Excel izklājlapas. Varat lietot arī citas profesionālās statistikas vides, bet Excel ir pilnīgi pietiekami\" Tad tā arī pusgadu mācīsies par statistiku un varbūtību teoriju, kas, kopā ar statistikas kontekstu un Excel =IEVIETO_FORMULU, nemaz nav tik biedējoši, kā varētu šķist. Un galu galā, ja pēc šāda kursa var atcerēties, kas ir standartnovirze un normālais sadalījums, tad domāju, ka profesore savu darbu ir labi padarījusi.",{"title":29,"img":9,"altText":30,"teaser":31,"content":32},"Automātu teorija","Pieraksti kur uzzīmēti grafi, kas apzīmē automātus.","Viss vienkāršais ir ģeniāls...","Vai zini to sajūtu, kad vienlaikus visu saproti, bet tajā pašā laikā nesaproti itin neko? Aptuveni tā varētu aprakstīt Automātu teorijas kursu. Sākumā apspriedīsiet, kas ir automāts, kā tas strādā, kur tas \"dzīvo\" un ko tas \"ēd\". Un tieši brīdī, kad domā, ka saproti, ka automāts ir tas pats algoritms, tikai bišķi savādāk izteikts, profesors uz tāfeles sāks rakstīt pumpēšanas lemmu, un tad varu novēlēt tikai veiksmi.          ",{"title":34,"img":35,"altText":36,"teaser":37,"content":38},"Ievads uzņēmējdarbībā","../../df-bizness.jpg","Kaudze ar sapakotām paciņām.","Šaubos, ka gribēsi būt biznesmens...","Viens no valsts noteiktajiem kursiem, kura mērķis ir, lai katrs students kaut ko iemācītos par uzņēmējdarbību un veicinātu biznesa attīstību mūsu valstī. Diemžēl no šī kursa tu, visticamāk, neiemācīsies gandrīz neko, tāpēc iesaku izvēlēties biznesa ideju, par kuru pašam ir jautri domāt un vienkārši izbaudīt laiku ar komandu, kur jūs divas stundas mēģināsiet izdomāt biznesa nosaukumu un vēl trīs - kādus mārketinga pasākumus veiksiet (atbilde vienmēr būs Instagram un Facebook)."],"uses":{"params":["name","year"]}}]}
